<?php
/**
*
* Precise Similar Topics [English]
*
* @copyright (c) 2013 Matt Friedman
* @license GNU General Public License, version 2 (GPL-2.0)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine
//
// Some characters you may want to copy&paste:
// ’ » “ ” …
//

$lang = array_merge($lang, array(
	'PST_TITLE_ACP'		=> 'Схожі теми',
	'PST_EXPLAIN'		=> 'Розширення "Схожі теми" відображає список схожих (пов\'язаних) тем внизу на сторінці з повідомленнями теми, що переглядається.',
	'PST_LEGEND1'		=> 'Основні налаштування',
	'PST_ENABLE'		=> 'Відображати схожі теми',
	'PST_LEGEND2'		=> 'Налаштування завантаження',
	'PST_LIMIT'			=> 'Кількість схожих тем для відображення',
	'PST_LIMIT_EXPLAIN'	=> 'Тут можна встановити кількість тем, які показуватимуться в блоці "Схожі теми". За замовчуванням встановлено відображення 5 схожих тем.',
	'PST_TIME'			=> 'Період пошуку схожих тем',
	'PST_TIME_EXPLAIN'	=> 'Ця опція дає змогу обмежити пошук схожих тем тільки серед нових тем форуму (запобігти пошуку серед зовсім старих тем). Наприклад, якщо опцію встановлено на "30 днів", то пошук здійснюватиметься тільки в темах, розміщених на форумі за останній місяць. За замовчуванням встановлено 1 рік. Встановіть цю опцію на 99 років, якщо хочете повністю виключити використання цієї опції.',
	'PST_YEARS'			=> 'років',
	'PST_MONTHS'		=> 'місяців',
	'PST_WEEKS'			=> 'тижнів',
	'PST_DAYS'			=> 'днів',
	'PST_CACHE'			=> 'Розмір кешу для розширення "Схожі теми"',
	'PST_CACHE_EXPLAIN'	=> 'Кількість секунд, після закінчення якої очищається кеш розширення "Схожі теми". Встановіть цю опцію в 0, якщо хочете повністю відключити кешування для цього розширення.',
	'PST_SENSE'			=> 'Чутливість пошуку',
	'PST_SENSE_EXPLAIN'	=> 'Тут можна встановити чутливість пошуку в межах від 1 до 10. Використовуйте число менше встановленого, якщо не відображається жодна схожа тема. Рекомендоване налаштування: якщо тип таблиці "phpbb_topics" встановлено в InnoDB, то встановіть 1; для типу MyISAM встановіть 5.',
	'PST_LEGEND3'		=> 'Налаштування форуму',
	'PST_NOSHOW_LIST'	=> 'Не відображати у',
	'PST_NOSHOW_TITLE'	=> 'Не відображати схожі теми у',
	'PST_IGNORE_SEARCH'	=> 'Не шукати у',
	'PST_IGNORE_TITLE'	=> 'Не здійснювати пошук схожих тем у',
	'PST_STANDARD'		=> 'Стандартні',
	'PST_ADVANCED'		=> 'Просунуті',
	'PST_ADVANCED_TITLE'=> 'Клацніть мишкою для того, щоб відкрити просунуті установки розширення "Схожі теми"',
	'PST_ADVANCED_EXP'	=> 'Тут ви можете вказати конкретні розділи форуму, звідки брати схожі теми. У блоці "Схожі теми" відображатимуться теми ТІЛЬКИ із зазначених тут розділів.<br /><br />Якщо ви не виберете жоден розділ, то пошук схожих тем здійснюватиметься по всіх розділах форуму.<br /><br />Можна вибрати кілька розділів за допомогою клавіші <samp>CTRL</samp> (або клавіші <samp>&#8984;CMD</samp> на комп\'ютерах Mac) і лівої кнопки мишки.',
	'PST_ADVANCED_FORUM'=> 'Просунуті налаштування',
	'PST_DESELECT_ALL'	=> 'Скинути все',
	'PST_LEGEND4'		=> 'Необов\'язкові налаштування',
	'PST_WORDS'			=> 'Ігнорувати окремі слова',
	'PST_WORDS_EXPLAIN'	=> 'Тут можна прописати окремі слова, які не враховуватимуться під час пошуку схожих тем. (Увага: деякі загальні слова мови, яку ви використовуєте, вже ігноруються за замовчуванням). Кожне слово відокремлюється пропуском. Регістр слів не враховується.',
	'PST_SAVED'			=> 'Налаштування розширення "Схожі теми" оновлено',
	'PST_FORUM_INFO'	=> '«Не відображати в": в обраних тут розділах блок "Схожі теми" відображатися не буде.<br />«Не здійснювати пошук схожих тем у": в обраних тут розділах пошук схожих тем здійснюватися не буде.',
	'PST_NO_COMPAT'		=> 'Розширення "Схожі теми" не сумісне з вашим форумом. Для використання цього розширення необхідне використання бази даних MySQL або PostgreSQL.',
	'PST_ERR_CONFIG'	=> 'Обрано занадто багато розділів форуму. Будь ласка, вкажіть меншу кількість розділів.',
));
