<?php
/**
*
* @package UserReminder v1.7.0
* @copyright (c) 2019 - 2023 Mike-on-Tour
* @license http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
                    // language pack author
                        'ACP_USERREMINDER_LANG_DESC'                => 'Ukrainian',
                        'ACP_USERREMINDER_LANG_EXT_VER'             => '1.7.0',
                        'ACP_USERREMINDER_LANG_AUTHOR'                 => 'Oleksii Lysenko (Classic)',

	// Module
	'CONFIRM_USER_DELETE'						=> [
		1	=> 'Ви дійсно впевнені, що хочете видалити 1 користувача?<br><br><strong>Користувача назавжди буде видалено з бази даних і ця дія незворотна!trong>',
		2	=> 'Ви дійсно впевнені, що хочете видалити %d користувачів?<br><br><strong>Користувачів назавжди буде видалено з бази даних і ця дія незворотна!</strong>',
	],
	'NO_USER_SELECTED'							=> 'Ви нікого не вибрали для виконання цієї дії, відзначте хоча б одного користувача.',
	'USER_DELETED'								=> [
		1	=> '1 користувача успішно видалено',
		2	=> '%d користувачів успішно видалено',
	],
	'USER_REMINDED'								=> [
		1	=> 'Нагадування електронною поштою надіслано 1 користувачеві',
		2	=> 'Нагадування електронною поштою надіслано %d користувачам',
	],
	'USER_POSTS'								=> 'Повідомлення',
	'DAYS_AGO'									=> 'Днів тому',
	'AT_DATE'									=> 'Дата',
	'MARK_REMIND'								=> 'Нагадування',
	'MARK_DELETE'								=> 'Видалити',
	'REMIND_MARKED'								=> 'Відправити нагадування зазначеним',
	'REMIND_ALL'								=> 'Нагадати всім',
	'ACP_USERREMINDER_REMIND_ALL_TEXT'			=> 'Відправити нагадування всім користувачам з цієї таблиці',
	'ACP_USERREMINDER_DELETE_ALL_TEXT'			=> '<span style="color:red">Видалити <b>УСІХ</b> користувачів із цієї таблиці!</span>',
	'LOG_INACTIVE_REMIND_ONE'					=> '<strong>Надіслано перше нагадування неактивним користувачам</strong><br>» %s',
	'LOG_INACTIVE_REMIND_TWO'					=> '<strong>Відправлено друге нагадування неактивним користувачам</strong><br>» %s',
	'LOG_SLEEPER_REMIND'						=> '<strong>Надіслано нагадування сплячим користувачам</strong><br>» %s',
	//ACP
	'ACP_USERREMINDER'							=> 'Нагадування користувачам',
	'ACP_USERREMINDER_SETTINGS'					=> 'Налаштування нагадувань',
	'ACP_USERREMINDER_SETTINGS_EXPLAIN'			=> 'Тут можна налаштувати нагадування користувачам.',
	'ACP_USERREMINDER_SETTING_SAVED'			=> 'Налаштування нагадувань були успішно збережені.',
	'ACP_USERREMINDER_GENERAL_SETTINGS'			=> 'Загальні налаштування',
	'ACP_USERREMINDER_ROWS_PER_PAGE'			=> 'Рядків на сторінці',
	'ACP_USERREMINDER_ROWS_PER_PAGE_TEXT'		=> 'Виберіть кількість рядків, яка відображатиметься в таблиці на кожній окремій сторінці.',
	'ACP_USERREMINDER_EXPERT_MODE'				=> 'Режим експерта',
	'ACP_USERREMINDER_EXPERT_MODE_TEXT'			=> 'Якщо ви активуєте цей режим, то на вкладках "Неактивні користувачі", "Сплячі користувачі" і "Користувачі без повідомлень" під таблицею з\'являться дві додаткові кнопки: перша дасть змогу вам надіслати нагадування одразу всім переліченим у таблиці користувачам, а друга дасть змогу видалити всіх користувачів із таблиці за раз.<br><span style="color:red">Оскільки насамперед кнопка "Видалити все" може завдати серйозної шкоди вашій конференції, використання опції рекомендується тільки адміністраторам, які усвідомлюють пов\'язані з цим небезпеки! Будь ласка, прочитайте відповідний розділ у файлі "README.md" перед використанням цього режиму.</span>',
	'ACP_USERREMINDER_TIME_SETTINGS_TITLE'		=> 'Налаштування інтервалів нагадувань',
	'ACP_USERREMINDER_TIME_SETTING_TEXT'		=> 'Тут ви можете задати час у днях, перш ніж користувача вважатимуть неактивним, час у днях між першим і другим нагадуванням про необхідність входу в систему, а також задати період до видалення неактивного користувача.',
	'ACP_USERREMINDER_INACTIVE'					=> 'Кількість днів, після яких користувач вважатиметься неактивним, якщо протягом цього терміну він не відвідав конференцію',
	'ACP_USERREMINDER_DAYS_REMINDED'			=> 'Кількість днів, після яких неактивний користувач отримає друге нагадування.<br>Встановіть ´0´, щоб відключити надсилання другого нагадування',
	'ACP_USERREMINDER_AUTOREMIND'				=> 'Надсилати нагадування автоматично',
	'ACP_USERREMINDER_DAYS_UNTIL_DELETED'		=> 'Кількість днів, що минули з моменту останнього нагадування, перш ніж користувача може бути видалено',
	'ACP_USERREMINDER_AUTODELETE'				=> 'Видаляти користувачів автоматично',
	// ACP Sleeper settings
	'ACP_USERREMINDER_SLEEPER_CONFIG'			=> 'Налаштування нагадувань для сплячих користувачів',
	'ACP_USERREMINDER_SLEEPER_CONFIG_TEXT'		=> 'Тут ви можете вибрати, чи слід надсилати нагадування сплячим користувачам і через яку кількість днів це має відбуватися, а також чи повинні користувачі автоматично видалятися через певну кількість днів.',
	'ACP_USERREMINDER_REMIND_SLEEPER'			=> 'Надсилати нагадування сплячим користувачам',
	'ACP_USERREMINDER_REMIND_SLEEPER_TEXT'		=> 'Увімкніть цю опцію, якщо хочете надсилати сплячим користувачам нагадування про необхідність відвідати вашу конференцію після реєстрації. Після увімкнення ви побачите додаткові налаштування.',
	'ACP_USERREMINDER_SLEEPER_INACTIVE'			=> 'Кількість днів між реєстрацією та нагадуванням',
	'ACP_USERREMINDER_AUTODELETE_SLEEPER'		=> 'Видаляти сплячих користувачів автоматично',
	'ACP_USERREMINDER_AUTODELETE_SLEEPER_TEXT'	=> 'У разі ввімкнення цієї опції сплячі користувачі будуть видалятися автоматично.<br>
                                 Після ввімкнення ви побачите додаткове налаштування, де можна буде виставити кількість днів, після закінчення яких сплячий користувач буде видалений. Залежно від того, чи ввімкнули ви надсилання нагадувань сплячим користувачам, відлік відбуватиметься або з моменту нагадування, або з моменту реєстрації.',
	'ACP_USERREMINDER_SLEEPER_DELETETIME'		=> 'Кількість днів до видалення',
	// ACP Zeroposter settings
	'ACP_USERREMINDER_ZEROPOSTER_CONFIG'		=> 'Налаштування нагадувань для користувачів без повідомлень',
	'ACP_USERREMINDER_ZEROPOSTER_CONFIG_TEXT'	=> 'Тут ви можете вибрати, чи слід розглядати користувачів без повідомлень як неактивних. Якщо так, то всі налаштування з попереднього розділу застосовуватимуться і до цих користувачів. У цьому разі користувачі без повідомлень відображатимуться в розширеній таблиці з датами першого і другого нагадувань і полем із вибором для видалення, все так само, як і в таблиці для неактивних користувачів.',
	'ACP_USERREMINDER_REMIND_ZEROPOSTER'		=> 'Надсилати нагадування і видаляти користувачів без повідомлень як неактивних',
    'ACP_USERREMINDER_ZP_INACTIVE'                => 'Кількість днів, протягом яких зеропостер має перебувати поза мережею, перш ніж цей користувач вважатиметься неактивним',
    'ACP_USERREMINDER_ZP_DAYS_REMINDED'            => 'Кількість днів до того, як зеропостер, який вважається неактивним, отримає другий лист із нагадуванням;<br>
                                 надсилання другого листа неактивне, якщо ви введете ´0´.',
    'ACP_USERREMINDER_ZP_AUTOREMIND'            => 'Автоматично надсилати листи з нагадуваннями?',
    'ACP_USERREMINDER_ZP_DAYS_UNTIL_DELETED'    => 'Кількість днів після останнього нагадування до видалення зеропостера',
    'ACP_USERREMINDER_ZP_AUTODELETE'            => 'Автоматичне видалення нульових постів?',
	// ACP Protection settings
	'ACP_USERREMINDER_PROTECTION_CONFIG'		=> 'Налаштування виключень',
	'ACP_USERREMINDER_PROTECTION_CONFIG_TEXT'	=> 'Ви також можете вказати користувачів, які будуть виключені зі списків нагадувань і видалення. Ви можете вибрати окремих користувачів і/або групи з користувачами, якщо вона встановлена для них групою за замовчуванням. Обидва варіанти працюють незалежно.',
	'ACP_USERREMINDER_PROTECTED_MEMBERS'		=> 'Введіть імена користувачів, яких ви хочете виключити зі списку нагадувань і видалення.<br>Кожне ім\'я користувача ПОВИННЕ БУТИ на окремому рядку!',
	'ACP_USERREMINDER_PROTECTED_GROUPS'			=> 'Будь ласка, виберіть групи, учасників яких слід виключити зі списку нагадувань і видалення. Група має бути встановлена для користувача групою за замовчуванням, щоб це правило працювало. Вибрані раніше групи вже виділені. <br>Утримуючи клавішу ´Ctrl´ ви можете виділити відразу кілька груп',
	// ACP Mail settings
	'ACP_USERREMINDER_MAIL_SETTINGS_TITLE'		=> 'Налаштування електронної пошти',
	'ACP_USERREMINDER_MAIL_LIMITS_TEXT'			=> 'Тут ви можете ввести обмеження, встановлені вашим провайдером для надсилання електронних листів. Ці налаштування важливі для запобігання втрат під час надсилання великої кількості листів електронною поштою, що перевищує зазначені обмеження.<br>Попередньо встановлені значення відповідають максимальній кількості в 150 електронних листів, які можна надіслати протягом однієї години (3600 секунд). <strong>Будь ласка, введіть значення, які відносяться до вашого провайдера електронної пошти!</strong>',
	'ACP_USERREMINDER_MAIL_LIMIT_NUMBER'		=> 'Максимальна кількість листів',
	'ACP_USERREMINDER_MAIL_LIMIT_TIME'			=> 'Часові рамки, протягом яких може бути надіслано цю кількість електронних листів',
	'ACP_USERREMINDER_MAIL_LIMIT_SECONDS'		=> 'секунд',
	'ACP_USERREMINDER_CRON_EXP'					=> 'Для довідки ви можете подивитися тут, у який час завдання cron для надсилання листів запускали востаннє, і скільки листів можна надіслати наразі без черги.',
	'ACP_USERREMINDER_LAST_CRON_RUN'			=> 'Останній раз завдання Cron виконувалося',
	'ACP_USERREMINDER_AVAILABLE_MAIL_CHUNK'		=> 'Доступна кількість листів на цей момент',
    'ACP_USERREMINDER_MAILS_WAITING'            => 'Загальна кількість листів, які перебувають у поштовій черзі User Reminder',
    'ACP_USERREMINDER_EMAIL_BCC_TEXT'			=> 'Тут ви можете вказати по одній адресі електронної пошти для надсилання прихованої копії та/або копії електронних листів із нагадуваннями.',
	'ACP_USERREMINDER_EMAIL_BCC'				=> 'Відправляти приховану копію на',
    'ACP_USERREMINDER_EMAIL_CC'                    => 'Надсилати копію на',
    'ACP_USERREMINDER_EMAIL_FROM'                => 'Адреса, що використовується для листів з нагадуваннями',
    'ACP_USERREMINDER_EMAIL_FROM_TEXT'            => 'Тут ви можете задати адресу електронної пошти, яка буде використовуватися в якості адреси FROM у всіх листах, створюваних User Reminder. Якщо залишити це поле порожнім, то буде використовуватися "З адреси електронної пошти" з вкладки "Налаштування електронної пошти".',
    'ACP_USERREMINDER_SUPPRESS_REPLYTO'            => 'Придушення адреси для відповіді на листи з нагадуваннями',
    'ACP_USERREMINDER_SUPPRESS_REPLYTO_TEXT'    => 'Якщо ви хочете придушити адресу reply-to в листах із нагадуваннями, наприклад, тому що ви використовуєте як відправника адресу noreply, ви можете зробити це тут ви можете зробити це тут. Після активації цього налаштування адресу відповіді буде видалено із заголовка листів із нагадуваннями.',
    
	// ACP Mail text edit
	'ACP_USERREMINDER_MAIL_EDIT_TITLE'			=> 'Редагувати текст нагадувань',
	'ACP_USERREMINDER_MAIL_EDIT_TEXT'			=> 'Тут ви можете відредагувати попередньо встановлений текст першого і другого листа з нагадуванням.',
	'ACP_USERREMINDER_MAIL_LANG'				=> 'Вибрати мову',
	'ACP_USERREMINDER_MAIL_FILE'				=> 'Виберіть файл, який ви хочете змінити',
	'ACP_USERREMINDER_MAIL_ONE'					=> '1-е нагадування',
	'ACP_USERREMINDER_MAIL_TWO'					=> '2-е нагадування',
	'ACP_USERREMINDER_MAIL_SLEEPER'				=> 'Нагадування для сплячого',
	'ACP_USERREMINDER_MAIL_PREVIEW'				=> 'В окне справа вы можете редактировать текст выбранного письма. При нажатии на кнопку ´Предпросмотр´ ниже будет отображён текст в том виде, в котором его получит пользователь по электронной почте. Токени будуть замінені вашими відповідними даними. Разом із попереднім переглядом буде доступна кнопка для збереження тексту у вигляді файлу на вашому сервері.<br>
                                 Ви можете використовувати такі токени як заповнювачі для відповідних даних адресованого користувача:<br>
													- {USERNAME}: Ім\'я користувача<br>
													- {LAST_VISIT}: Дата останнього відвідування<br>
													- {LAST_REMIND}: Дата першого листа з нагадуванням<br>
													- {REG_DATE}: Дата реєстрації<br>
                                 Наступні токени можна використовувати як заповнювачі для системних даних:<br>
													- {SITENAME}: Назва вашої конференції<br>
													- {FORGOT_PASS}: Посилання на ´Я забув пароль´<br>
													- {ADMIN_MAIL}: Електронна пошта конференції<br>
													- {EMAIL_SIG}: Підпис в email-повідомленні<br>
													- {DAYS_INACTIVE}: Зазначена вище кількість днів неактивності<br>
													- {DAYS_TIL_DELETE}: Зазначена вище кількість днів до видалення<br>
													- {DAYS_DEL_SLEEPERS}: Зазначена вище кількість днів до видалення сплячого користувача<br>',
	'ACP_USERREMINDER_MAIL_LOAD_FILE'			=> 'Показати файл',
	'ACP_USERREMINDER_PREVIEW_TEXT'				=> 'Примітка:<br>У тексті попереднього перегляду токени з даними адресованого користувача замінюються вашими відповідними даними, це означає, що результуючий текст логічно може не мати жодного сенсу.',
	'ACP_USERREMINDER_MAIL_SAVE_FILE'			=> 'Зберегти файл',
	'ACP_USERREMINDER_FILE_NOT_FOUND'			=> 'Не вдалося завантажити файл ´%s´.',
	'ACP_USERREMINDER_FILE_ERROR'				=> 'Сталася помилка під час збереження файлу ´%s´! <br>Файл <strong>не було збережено</strong>!',
	'ACP_USERREMINDER_FILE_SAVED'				=> 'Успішно збережено файл ´%s´.',
                    'ACP_USERREMINDER_SEND_TESTMAIL'            => 'Надішліть тестовий лист на цю адресу електронної пошти',
                        'ACP_USERREMINDER_SEND_TESTMAIL_EXPL'        => 'Використовуйте попередньо обрану адресу електронної пошти або введіть іншу дійсну адресу, на яку буде надіслано тестовий лист, що містить текст обраної пошти мовою ранку.<br>
                                                                        NOTE: Якщо текст було відредаговано, будь ласка, збережіть його перед надсиланням тестового листа, інакше буде використано невідредагований текст!',
                        'ACP_USERREMINDER_ENTER_EMAIL_ADDRESS'        => 'Введіть дійсну адресу електронної пошти',
                        'ACP_USERREMINDER_SENDMAIL'                    => 'Надіслати лист',
                        'ACP_USERREMINDER_TESTMAIL_SENT'            => 'Тестовий лист було надіслано, будь ласка, перевірте папку вхідних повідомлень зазначеної поштової скриньки.',
	// ACP Reminder
                    'ACP_USERREMINDER_REMINDER'                    => 'Remind users',
	'ACP_USERREMINDER_REMINDER_EXPLAIN'			=> 'Список користувачів, які залишали повідомлення, але не відвідували конференцію протягом певної кількості днів, зазначеної на вкладці налаштувань, що кваліфікує їх як неактивних. Ви можете вручну вибрати цих користувачів, щоб надіслати їм електронні листи з нагадуванням, або ж видалити їх після закінчення встановленого періоду часу після того, як було надіслано друге нагадування. Видалення неможливо вибрати доти, доки не минуть певні періоди на вкладці налаштувань, за які користувач так і не увійде в систему хоча б один раз.',
	'ACP_USERREMINDER_REMINDER_ONE'				=> 'Перше нагадування',
	'ACP_USERREMINDER_REMINDER_TWO'				=> 'Друге нагадування',
	'ACP_USERREMINDER_NO_ENTRIES'				=> 'Дані недоступні',
	'ACP_USERREMINDER_SORT_DESC'				=> 'За зростанням',
	'ACP_USERREMINDER_SORT_ASC'					=> 'За спаданням',
	'ACP_USERREMINDER_KEY_RD'					=> 'Дата реєстрації',
	'ACP_USERREMINDER_KEY_LV'					=> 'Останнє відвідування',
	'ACP_USERREMINDER_KEY_RO'					=> '1-е нагадування',
	'ACP_USERREMINDER_KEY_RT'					=> '2-ге нагадування',
	// ACP Sleeper
	'ACP_USERREMINDER_SLEEPER'					=> 'Сплячі користувачі',
	'ACP_USERREMINDER_SLEEPER_EXPLAIN'			=> 'Список користувачів, які жодного разу не відвідували конференцію після реєстрації та активації.',
	'ACP_USERREMINDER_REMINDER'					=> 'Неактивні користувачі',
	'ACP_USERREMINDER_KEY_RE'					=> 'Дата',
	// ACP Zeroposters
	'ACP_USERREMINDER_ZEROPOSTER'				=> 'Користувачі без повідомлень',
	'ACP_USERREMINDER_ZEROPOSTER_EXPLAIN'		=> 'Список користувачів, які не залишили жодного повідомлення на конференції.',
	// Support and Copyright
	'ACP_USERREMINDER_SUPPORT'					=> 'Якщо ви хочете підтримати розробку розширення User Reminder, скористайтеся цим посиланням',
	'ACP_USERREMINDER_VERSION'					=> '<img src="https://img.shields.io/badge/Version-%1$s-green.svg?style=plastic" /><br>&copy; 2019 - %2$d by Mike-on-Tour',
));
