<?php
/**
*
*  @package Antibot 42
*  @copyright (c) 2019 Татьяна5 and Nekstati
*  @license GNU General Public License, version 2 (GPL-2.0)
*
*/

if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_ANTIBOT42'						=> 'Antibot 42',
	'ACP_ANTIBOT42_SETTINGS'			=> 'Налаштування',
	'ACP_ANTIBOT42_SETTINGS_EXPLAIN'	=> 'Ще один спосіб усунути спам на вашому форумі. Можливо, найкращий.',

	'ACP_ANTIBOT42_REG'					=> 'Увімкнути захист',
	'ACP_ANTIBOT42_REG_EXPLAIN'			=> 'Якщо на вашому сайті зустрічаються спам-боти, зареєстровані вручну, увімкніть захист і для зареєстрованих користувачів. В іншому разі достатньо увімкнути для гостей.',
	'ACP_ANTIBOT42_REG_OPTION_1'		=> 'Для гостей та зареєстрованих',
	'ACP_ANTIBOT42_REG_OPTION_0'		=> 'Тільки для гостей',

	'ACP_ANTIBOT42_LOG'					=> 'Вести лог',
	'ACP_ANTIBOT42_LOG_EXPLAIN'			=> 'У лог записуються невдалі спроби реєстрації та постингу, а також випадки вдалої реєстрації для порівняльної статистики.',

	'ACP_ANTIBOT42_GEOIP'				=> 'Використовувати GeoIP',
	'ACP_ANTIBOT42_GEOIP_EXPLAIN'		=> 'Географічне положення ботів додається в лог. Якщо ваш сайт атакують натовпи ботів, ця функція може збільшити навантаження на сервер.',

	'ACP_ANTIBOT42_BAN'				=> 'Блокувати ймовірних спамерів',
	'ACP_ANTIBOT42_BAN_EXPLAIN'		=> 'Блокування ймовірних спамерів за ip на 5 хвилин після 10 спроб обійти захист. Лічильник спроб обнулиться після закінчення часу сесії.',

	'ACP_ANTIBOT42_METHODS_NOTICE'		=> 'Наступні параметри потрібні для тестування розширення. Якщо не збираєтеся брати участь у тестуванні, залиште всі пункти увімкненими.',

	'ACP_ANTIBOT42_METHOD1'				=> 'Метод виявлення ботів №1',
	'ACP_ANTIBOT42_METHOD1_EXPLAIN'		=> 'Застосовується до форм реєстрації, постингу та зв\'язку з адміністрацією.',
	'ACP_ANTIBOT42_METHOD2'				=> 'Метод виявлення ботів №2',
	'ACP_ANTIBOT42_METHOD2_EXPLAIN'		=> 'Застосовується до форм реєстрації, постингу та зв\'язку з адміністрацією.',
	'ACP_ANTIBOT42_METHOD3'				=> 'Метод виявлення ботів №3',
	'ACP_ANTIBOT42_METHOD3_EXPLAIN'		=> 'Застосовується до форми реєстрації.',
	'ACP_ANTIBOT42_METHOD4'				=> 'Метод виявлення ботів №4',
	'ACP_ANTIBOT42_METHOD4_EXPLAIN'		=> 'Застосовується до форми реєстрації.',
	'ACP_ANTIBOT42_METHOD5'				=> 'Метод виявлення ботів №5',
	'ACP_ANTIBOT42_METHOD5_EXPLAIN'		=> 'Застосовується до форм реєстрації, постингу, зв\'язку з адміністрацією, надсилання email і надсилання особистих повідомлень. Використовуйте цей метод з обережністю: він може викликати проблеми у користувачів, які відключили JavaScript у своїх браузерах.',

	'ACP_ANTIBOT42_LOG_TEXT'			=> 'Лог',
	'ACP_ANTIBOT42_LOG_COPY'			=> 'Копіювати',
	'ACP_ANTIBOT42_LOG_COPIED'			=> 'Лог скопійовано в буфер обміну.',
	'ACP_ANTIBOT42_LOG_DELETE'			=> 'Видалити',
	'ACP_ANTIBOT42_LOG_DELETE_CONFIRM'	=> 'Видалити лог розширення Antibot 42? Точно?',
	'ACP_ANTIBOT42_LOG_DELETE_SUCCESS'	=> 'Лог видалено.',
	'ACP_ANTIBOT42_LOG_NOT_READABLE'	=> 'Файл лога %s або його папка відсутні або недоступні для читання.',
	'ACP_ANTIBOT42_LOG_NOT_WRITABLE'	=> 'Файл лога %s або його папка відсутні або недоступні для запису.',

	'ACP_ANTIBOT42_GEOIP_NO_DB'			=> 'Функцію GeoIP увімкнено, але бази даних GeoIP не знайдено. <a href="https://dev.maxmind.com/geoip/geoip2/geolite2/">Скачайте их</a> (як мінімум базу GeoLite2 Country) і розпакуйте в папку %s.',
	'ACP_ANTIBOT42_GEOIP_COUNTRY_ONLY'	=> 'Зараз GeoIP відображає тільки країну спам-бота. Щоб відображалося також і місто, <a href="https://dev.maxmind.com/geoip/geoip2/geolite2/">скачайте базу міст</a> і розпакуйте її в папку %s.',

	'ACP_ANTIBOT42_NOTICE'				=> '
                                 Якщо ви хочете допомогти нам <b>покращити захист від спам-ботів</b>, зробіть наступне:
		<ul>
			<li>протестуйте і повідомте нам, який метод виявлення ботів працює краще на вашому сайті (1-й день - 1-й метод, 2-й день - 2-й метод тощо).;</li>
			<li>тимчасово вимкніть інші засоби проти спам-ботів, зокрема й капчу, і повідомте нам, наскільки виявився ефективним Antibot 42 сам по собі;</li>
			<li>тимчасово дозвольте гостьовий постинг і повідомте нам, чи з\'явився спам;</li>
			<li>скопіюйте і надішліть нам лог, коли в ньому накопичиться 200-300 рядків або більше.</li>
		</ul>
                                 Лог не містить жодної інформації про ваш сайт і користувачів (крім IP-адрес ботів).<br />
                                 Ви знайдете нас там: <a href="https://phpbbguru.net/community/">https://phpbbguru.net/community/</a>',

	'ACP_ANTIBOT42_VERSION_ALERT'		=> 'Деякі функції цього розширення вимкнено через їхню несумісність із вашою версією phpBB. <br /> Захист від спам-ботів послаблено. Рекомендована версія phpBB: 3.2.2 або вище.',
));
