<?php
/**
 *
 * @package       QuickReply Reloaded
 * @copyright (c) 2014 - 2021 Татьяна5 and LavIgor
 * @license       http://opensource.org/licenses/gpl-2.0.php GNU General Public License v2
 *
 */

/**
 * DO NOT CHANGE
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_QUICKREPLY'                       => 'Швидка відповідь',
	'ACP_QUICKREPLY_EXPLAIN'               => 'Налаштування швидкої відповіді',
	'ACP_QUICKREPLY_TITLE'                 => 'Швидка відповідь',
	'ACP_QUICKREPLY_TITLE_EXPLAIN'         => 'Тут ви можете задати основні та форумні налаштування для форми швидкої відповіді.<br /> ПРИМІТКА: налаштування "Дозволити швидку відповідь" і "Увімкнути швидку відповідь" вбудовано в рушій phpBB і представлено тут для зручності та повноти. Інші представлені тут налаштування залежать від них.',
	//
	'ACP_QUICKREPLY_QN'                    => 'Налаштування швидкої цитати та звернення за ніком',
	'ACP_QUICKREPLY_QN_EXPLAIN'            => 'Налаштування швидкої цитати та звернення за ніком',
	'ACP_QUICKREPLY_QN_TITLE'              => 'Швидка відповідь',
	'ACP_QUICKREPLY_QN_TITLE_EXPLAIN'      => 'Тут ви можете задати налаштування швидкої цитати і звернення за ніком.<br /> ПРИМІТКА: ці налаштування не застосовуються у форумах, у яких швидку відповідь вимкнено, або в разі, якщо швидка відповідь не дозволена.',
	//
	'ACP_QUICKREPLY_PLUGINS'               => 'Додаткові налаштування',
	'ACP_QUICKREPLY_PLUGINS_EXPLAIN'       => 'Додаткові налаштування',
	'ACP_QUICKREPLY_PLUGINS_TITLE'         => 'Швидка відповідь',
	'ACP_QUICKREPLY_PLUGINS_TITLE_EXPLAIN' => 'Тут ви можете задати налаштування для особливих функцій, увімкнених у розширення для швидкої відповіді. <br /> ПРИМІТКА: ці налаштування застосовуються незалежно від того, чи увімкнено швидку відповідь у конкретному форумі.',
	//
	'ACP_QR_AJAX_PAGINATION'               => 'Увімкнути перегляд тем без перезавантаження сторінки',
	'ACP_QR_AJAX_PAGINATION_EXPLAIN'       => 'Якщо це налаштування ввімкнене, навігація Ajax буде використана замість звичайної відправки форми в разі ввімкнення користувачами опції "Не очищати форму швидкої відповіді під час перегляду теми".',
	'ACP_QR_AJAX_SUBMIT'                   => 'Дозволити Ajax надсилання повідомлень',
	'ACP_QR_AJAX_SUBMIT_EXPLAIN'           => 'Дозволити надсилання повідомлень без перезавантаження сторінки.<br />У разі ввімкнення цієї опції в необхідних форумах також має бути ввімкнена опція Ajax надсилання.',
	'ACP_QR_ALLOW_FOR_GUESTS'              => 'Дозволити використовувати швидку відповідь гостям, якщо вона увімкнена',
	'ACP_QR_ATTACH'                        => 'Дозволити завантаження вкладень',
	'ACP_QR_ATTACH_EXPLAIN'                => 'Дозволити завантаження вкладень із форми швидкої відповіді',
	'ACP_QR_BBCODE'                        => 'Відображати кнопки BBCode',
	'ACP_QR_BBCODE_EXPLAIN'                => 'Дозволити відображення кнопок BBCode у формі швидкої відповіді.',
	'ACP_QR_CAPSLOCK'                      => 'Увімкнути перетворення тексту у верхній/нижній регістр',
	'ACP_QR_COLOUR_NICKNAME'               => 'Додавати колір при зверненні за ніком',
	'ACP_QR_COMMA'                         => 'Увімкнути кому',
	'ACP_QR_COMMA_EXPLAIN'                 => 'Автоматично додавати кому після ніка при використанні опції "Звернення за нікнеймом".',
	'ACP_QR_CTRLENTER_NOTICE'              => 'Увімкнути підказку про можливість використання "Ctrl+Enter"',
	'ACP_QR_CTRLENTER_NOTICE_EXPLAIN'      => 'Підказка буде показана при наведенні курсору на кнопку "Відправити" у формі швидкої відповіді. Вимкнення цього налаштування не вимикає функцію надсилання повідомлення під час натискання "Ctrl+Enter".',
	'ACP_QR_ENABLE_AJAX_SUBMIT'            => 'Увімкнути Ajax надсилання повідомлень у всіх форумах',
	'ACP_QR_ENABLE_AJAX_SUBMIT_EXPLAIN'    => 'Дозволити використовувати Ajax надсилання повідомлень одразу у всіх форумах.',
	'ACP_QR_ENABLE_RE'                     => 'Увімкнути префікс "Re:"',
	'ACP_QR_ENABLE_RE_EXPLAIN'             => 'Автоматично додавати префікс "Re:" у поле "Заголовок повідомлення" у формах повної та швидкої відповіді.',
	'ACP_QR_ENABLE_QUICK_REPLY'            => 'Увімкнути швидку відповідь у всіх форумах',
	'ACP_QR_ENABLE_QUICK_REPLY_EXPLAIN'    => 'Дозволити використовувати швидку відповідь одразу у всіх форумах.',
	'ACP_QR_FORM_TYPE'                     => 'Тип форми швидкої відповіді',
	'ACP_QR_FORM_TYPE_EXPLAIN'             => 'При виборі типу "Фіксований з підвантаженням повідомлень" стандартну посторінкову навігацію буде доповнено можливістю довантажувати повідомлення на поточну сторінку за допомогою кнопок показу наступних/попередніх повідомлень.', // reserved
	'ACP_QR_FORM_TYPE_FIXED'               => 'Фіксований',
	'ACP_QR_FORM_TYPE_SCROLL'              => 'Фіксований з підвантаженням повідомлень', // reserved
	'ACP_QR_FORM_TYPE_STANDARD'            => 'Стандартний',
	'ACP_QR_FORUM_AJAX_SUBMIT'             => 'Увімкнути Ajax надсилання повідомлень',
	'ACP_QR_FORUM_AJAX_SUBMIT_EXPLAIN'     => 'Дозволити надсилання повідомлень без перезавантаження сторінки.',
	'ACP_QR_FULL_QUOTE'                    => 'Увімкнути повне цитування',
	'ACP_QR_FULL_QUOTE_EXPLAIN'            => 'Дозволити вставку повних цитат у форму швидкої відповіді за кліком на кнопку "Відповісти з цитатою".',
	'ACP_QR_HIDE_SUBJECT_BOX'              => 'Приховувати поле "Заголовок", якщо змінювати заголовок повідомлення не дозволено',
	'ACP_QR_HIDE_SUBJECT_BOX_EXPLAIN'      => 'Якщо у користувача відсутнє право на зміну заголовка повідомлення, поле "Заголовок" буде приховано, а не заблоковано у формі надсилання повідомлення.',
	'ACP_QR_LAST_QUOTE'                    => 'Увімкнути повне цитування останніх повідомлень тем',
	'ACP_QR_LAST_QUOTE_EXPLAIN'            => 'Дозволити можливість повного цитування за допомогою стандартної кнопки цитати.<br /><em>Зверніть увагу на те, що кнопка цитати буде прихована, якщо це налаштування вимкнено разом із налаштуванням для швидкої цитати. Це налаштування перевизначає право доступу для повної цитати.</em>',
	'ACP_QR_LEAVE_AS_IS'                   => 'Залишити як є',
	'ACP_QR_LEAVE_AS_IS_EXPLAIN'           => '<em>При виборі "Залишити як є" форумні налаштування не зміняться.</em>',
	'ACP_QR_LEGEND_AJAX'                   => 'Налаштування Ajax',
	'ACP_QR_LEGEND_DISPLAY'                => 'Налаштування відображення',
	'ACP_QR_LEGEND_GENERAL'                => 'Основні налаштування',
	'ACP_QR_LEGEND_QUICKNICK'              => 'Налаштування звернення за нікнеймом',
	'ACP_QR_LEGEND_QUICKQUOTE'             => 'Налаштування швидкої цитати',
	'ACP_QR_LEGEND_SPECIAL'                => 'Особливі функції',
	'ACP_QR_QUICKNICK'                     => 'Увімкнути звернення за нікнеймом (у випадаючому меню)',
	'ACP_QR_QUICKNICK_EXPLAIN'             => 'Створює меню, що випадає, з посиланням "Звернутися за нікнеймом", що дає змогу вставити нікнейм користувача у форму швидкої відповіді. Меню, що випадає, відображається після кліка на нікнеймі автора повідомлення і також містить посилання на профіль користувача і "Відповісти в ЛС" (якщо доступно).<br />Якщо це налаштування ввімкнено, а налаштування "Включити звернення за нікнеймом (рядок під аватарою)" вимкнено, користувач в особистому розділі зможе переключитися на варіант посилання "Звернутися за нікнеймом" під аватарою.',
	'ACP_QR_QUICKNICK_STRING'              => 'Увімкнути звернення за нікнеймом (рядок під аватарою)',
	'ACP_QR_QUICKNICK_STRING_EXPLAIN'      => 'Відображає посилання "Звернутися за нікнеймом" у мініпрофілях користувачів у темах, що дає змогу вставити нікнейм користувача у форму швидкої відповіді.',
	'ACP_QR_QUICKNICK_PM'                  => 'Увімкнути кнопку "Відповісти в ЛС" у список, що випадає, функції "Звернутися за нікнеймом"',
	'ACP_QR_QUICKNICK_REF'                 => 'Увімкнути спеціальний тег для звернення за нікнеймом',
	'ACP_QR_QUICKNICK_REF_EXPLAIN'         => 'BBCode [ref] додаватиметься замість [b] у функції "Звернутися за нікнеймом".<br /><em>Зверніть увагу на те, що в разі вимкнення цього налаштування користувачі отримуватимуть сповіщення про згадки тільки в тому разі, якщо тег [ref] було додано в повідомлення вручну.</em>',
	'ACP_QR_QUICKQUOTE'                    => 'Увімкнути швидке цитування через "спливайку"',
	'ACP_QR_QUICKQUOTE_BUTTON'             => 'Увімкнути швидке цитування за кнопкою',
	'ACP_QR_QUICKQUOTE_BUTTON_EXPLAIN'     => 'Дозволити можливість цитування за кліком на кнопку "Відповісти з цитатою".<br /><em>Зверніть увагу на те, що кнопка цитати буде прихована, якщо це налаштування вимкнене й у користувача немає права доступу для використання повної цитати.</em>',
	'ACP_QR_QUICKQUOTE_EXPLAIN'            => 'Дозволити можливість цитування через "спливайку", що з\'являється при виділенні тексту в повідомленні.',
	'ACP_QR_READ_NEXT'                     => 'Відображати кнопку "Читати далі"',
	'ACP_QR_SCROLL_TIME'                   => 'Час виконання однієї дії прокрутки та анімації',
	'ACP_QR_SCROLL_TIME_EXPLAIN'           => 'Час у мілісекундах для функції плавної прокрутки. Введіть 0 для стандартної прокрутки.',
	'ACP_QR_SHOW_BUTTON_TRANSLIT'          => 'Увімкнути кнопку "Трансліт"',
	'ACP_QR_SHOW_SUBJECTS'                 => 'Відображати заголовки повідомлень у темах',
	'ACP_QR_SHOW_SUBJECTS_IN_SEARCH'       => 'Відображати заголовки повідомлень у результатах пошуку',
	'ACP_QR_SMILIES'                       => 'Відображати смайли',
	'ACP_QR_SMILIES_EXPLAIN'               => 'Дозволити відображення смайлів у формі швидкої відповіді.',
));
